[
  {
    "name": "Project Sunday",
    "description": "A private group I co-founded that meets every Sunday to focus on working on personal projects and learning from each other. This group is responsible for getting several friends the knowledge and experience to obtain developer positions.",
    "role": [
      "Co-Founder",
      "Organizer",
      "Member",
      "Mentor"
    ],
    "time": "5 years"
  },
  {
    "name": "Free Code Camp Indy",
    "description": "This is a local, public Meetup group that focuses on extended learning outside of the FreeCodeCamp.com curriculum. We hold hackathons, monthly talks, and code 'n coffee meet ups. Gwen Faraday and I run the Indianapolis group. I've given several talks on the group's most requested material (Node, NPM, Bower, Grunt/Gulp, Sass/CSS).",
    "role": [
      "Organizer",
      "Member",
      "Mentor",
      "Presenter"
    ],
    "time": "4 years"
  },
  {
    "name": "Vue.js Indy",
    "description": "A group dedicated to exploring and learning about the fasting growing JavaScript framework in history, Vue.js. We have talks, work on projects together, have discussions and share. Very welcoming to beginners and those just learning Vue or even just learning JavaScript.",
    "role": [
      "Founder",
      "Organizer",
      "Member",
      "Mentor",
      "Presenter"
    ],
    "time": "3 years"
  },
  {
    "name": "Civic UX Group",
    "description": "I currently run this group, which was created as part of the Open Indy Brigade and is its longest running group. Our dedicated volunteers solve Civic issues with their UX skillsets. We've worked directly with IN.gov and various food assistance programs in central Indiana. Our most successful project is Koa11y, a tool for easily finding accessibility issues on the web.",
    "role": [
      "Organizer",
      "Mentor"
    ],
    "time": "2 years"
  },
  {
    "name": "Coder Dojo Indy",
    "description": "Coder Dojo is a free club for kids to learn to program. I've been volunteering as a mentor for 2 years.",
    "role": [
      "Mentor"
    ],
    "time": "2.5 years"
  },
  {
    "name": "Indy.JS",
    "description": "Indy.JS is the largest JavaScript meetup in Indianapolis. I've been regularly attending this meetup for years and have given several talks there.",
    "role": [
      "Member",
      "Presenter"
    ],
    "time": "5 years"
  },
  {
    "name": "Node Indy",
    "description": "A general-purpose Node.JS meetup that covers everything from Server Side best practices to Node-Bots. I routinely come to this meetup and have given small talks on Node, NPM, and using Node to create desktop apps.",
    "role": [
      "Member",
      "Presenter"
    ],
    "time": "2 years"
  },
  {
    "name": "Open Indy Brigade",
    "description": "Open Indy Brigade is a bridge between the Tech side of Indianapolis and the Civic/Political side. It focuses on solving Civic problems with technology. Developers, UI/UX designers, and Project Managers are presented with the problems our city faces and come up with practical solutions.",
    "role": [
      "Member"
    ],
    "time": "1.5 years"
  }
]
